# Taps
tap "argoproj/tap"
tap "espanso/espanso"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "johanhaleby/kubetail"
tap "teamookla/speedtest"

# Brews
brew "awscli"
brew "bat"
brew "cheat"
brew "delve"
brew "fd"
brew "fzf"
brew "go"
brew "goreleaser"
brew "helm"
brew "httpie"
brew "iproute2mac"
brew "jenv"
brew "jmeter"
brew "jq"
brew "k9s"
brew "kubectx"
brew "maven"
brew "terramate"
brew "tree"
brew "yq"
brew "zoxide"
brew "argoproj/tap/kubectl-argo-rollouts"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "johanhaleby/kubetail/kubetail", args: ["with-short-names"]
brew "teamookla/speedtest/speedtest"
brew "fnm"
brew "yarn"
brew "python"
brew "libpq" # PostgreSQL tools: https://stackoverflow.com/questions/44654216/correct-way-to-install-psql-without-full-postgres-on-macos

# Casks
cask "arc"
cask "docker"
cask "1password"
cask "1password-cli"
cask "espanso"
cask "iina"
cask "iterm2"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keepingyouawake"
cask "kui"
cask "logseq"
cask "miniconda"
cask "multipass"
cask "ngrok"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "rectangle"
cask "stats"
cask "visual-studio-code"
cask "warp"
cask "openvpn-connect"
cask "tunnelblick"
cask "hovrly"